[
    {
        "summary": "I am a graduate of Fırat University, Department of Electrical and Electronics Engineering. I am also a Double Major student in Computer Engineering. I've been a front-end developer for 1 year. I am trying to develop projects by using ReactJS, NextJS, HTML, CSS, SASS, Tailwind, Styled Component, React Native and TypeScript / JavaScript languages effectively and following the agenda. I'm also trying to learn backend paradigms with NodeJS (Express / Prisma / MySQL / PostgreSQL). In addition, in my last work experience, I tried to automate the build processes on the server using technologies such as pm2 / Nginx / jenkins. This was also a good experience for me."
    },
    {
        "experience": [
            {
                "date": "02.2020 - 04.2020",
                "location": "Gebze / Kocaeli",
                "role": "Internship Engineering",
                "company": "Antsis Elektronik",
                "description": "Designing and realizing projects on Embedded Systems and Antenna systems."
            },
            {
                "date": "06.2019 - 08.2019",
                "location": "Iskenderun / Hatay",
                "role": "Internship Engineering",
                "company": "ISDEMIR",
                "description": "Faults and system stabilization in the Electrical & Automation Maintenance unit in the Hot Rolling Mill, Examining the Hot Rolling Mill process and making improvements"
            },
            {
                "date": "06.2014 - 12.2014",
                "location": "Antakya / Hatay",
                "role": "Electrician",
                "company": "Yalcin Electric",
                "description": "House and construction electrical maintenance and repair, sales of materials, maintenance and repair of electrical appliances"
            },
            {
                "date": "06.2013 - 09.2013",
                "location": "Antakya / Hatay",
                "role": "Internship",
                "company": "Akin Bilisim",
                "description": "IT and Sound Systems Maintenance and Repair"
            },
            {
                "date": "06.2012 - 08.2012",
                "location": "Antakya / Hatay",
                "role": "Internship",
                "company": "M & B Bilisim",
                "description": "Performing Maintenance, Repair and Installation of Security Systems"
            },
            {
                "date": "01.03.2022 - 08.07.2022",
                "location": "Istanbul (Remote)",
                "role": "Frontend Developer",
                "company": "KG Information Technology Inc.",
                "description": "Frontend projects developed with React and NextJs were developed according to xd adobe designs and tasks. In addition, build operations were carried out by writing scripts on the server given by the company with Nginx, pm2 (process manager), jenkins (to build again by triggering with commit). It's been a good experience for me."
            }
        ]
    },
    {
        "education": [
            {
                "date": "09.2021 - In progress",
                "educationType": "Formal education",
                "language": "Turkish",
                "university": "Malatya Turgut Ozal University",
                "enst": "Faculty of Engineering and Natural Sciences",
                "description": "Electrical/Electronics Engineering Thesis Master's Degree",
                "grade": ""
            },
            {
                "date": "09.2015 - 06.2020 (graduate)",
                "educationType": "Secondary education",
                "language": "Turkish",
                "university": "Firat University",
                "enst": "Faculty of Technology",
                "description": "Electrical electronics Engineering",
                "grade": "3.38/4.00"
            },
            {
                "date": "08.2018 - Continuing (4th grade)",
                "educationType": "Formal education",
                "language": "Turkish",
                "university": "Firat University",
                "enst": "Faculty of Engineering",
                "description": "Computer Engineering(D.M.P)",
                "grade": "3.28/4.00"
            },
            {
                "date": "09.2015 - 06.2020 (graduate)",
                "educationType": "Formal education",
                "language": "Turkish",
                "university": "Erol Bilecik Technical and Industrial Vocational High School",
                "enst": "Electrical and Electronics Technology",
                "description": "Security systems",
                "grade": "3.38/4.00"
            }
        ]
    },
    {
        "projects": [
            {
                "description": "In this project, I developed the getir.com clone using ReactJS, TailwinCSS and Heroku."
            },
            {
                "description": "In this project, I developed the spotify.com clone using ReactJS and TailwinCSS."
            },
            {
                "description": "In this project, I participated in the front-end hiring challenge by Tatilbudur.com and entered the top 3."
            },
            {
                "description": "In this project, I developed the messenger-app using React JS and Firebase."
            },
            {
                "description": "In this project, I developed the Dashboard design using ChartJS, NextJs and TailwindCSS. You can login with serifcolakel@gmail.com and 1234."
            },
            {
                "description": "In this project, I developed the Todo App, which is preferred by full stack developers in the beginning phase, using NextJS, MongoDB, SASS, Vercel and Heroku."
            },
            {
                "description": "I developed Shopify App using NextJS, TailwindCSS, Shopify API."
            },
            {
                "description": "In this project, I participated in the hiring challenge competition created by etstur."
            },
            {
                "description": "In this project, I developed the portfolio of Yusuf Oztel using NextJS, TailwindCSS, TypeScript and Vercel."
            },
            {
                "description": "In this project, I developed the mobile application of Getir using React Native, TypeScript and redux-toolkit."
            }
        ]
    }
]